---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCTransformSetter.InitializeFromBoundingBox(Autodesk.Revit.DB.IFC.ExporterIFC,System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.IFC.IFCExtrusionCreationData)
source: html/a179cb08-3a54-de62-9323-a25771219357.htm
---
# Autodesk.Revit.DB.IFC.IFCTransformSetter.InitializeFromBoundingBox Method

## Syntax (C#)
```csharp
public Transform InitializeFromBoundingBox(
	ExporterIFC exporterIFC,
	IList<GeometryObject> geometryList,
	IFCExtrusionCreationData exportBodyParams
)
```

## Parameters
- **exporterIFC** (`Autodesk.Revit.DB.IFC.ExporterIFC`)
- **geometryList** (`System.Collections.Generic.IList < GeometryObject >`)
- **exportBodyParams** (`Autodesk.Revit.DB.IFC.IFCExtrusionCreationData`)